import FlowCard from "./FlowCard";

const steps = [
  {
    step: 1,
    title: "تعریف اهداف",
    description:
      "در این مرحله نیازها و خواسته‌های شما را بطور دقیق مشخص می‌کنیم. هدف، تصویر کلّی پروژه را شفاف می‌سازد تا همه اعضای تیم در مسیر درست قرار گیرند. این مرحله پایه و اساس تمام تصمیمات بعدی خواهد بود.",
  },
  {
    step: 2,
    title: "تحلیل و بررسی",
    description:
      "در این مرحله نیازها و خواسته‌های شما را بطور دقیق مشخص می‌کنیم. هدف، تصویر کلّی پروژه را شفاف می‌سازد تا همه اعضای تیم در مسیر درست قرار گیرند. این مرحله پایه و اساس تمام تصمیمات بعدی خواهد بود.",
  },
  {
    step: 3,
    title: "انتخاب فناوری‌ها",
    description:
      "در این مرحله نیازها و خواسته‌های شما را بطور دقیق مشخص می‌کنیم. هدف، تصویر کلّی پروژه را شفاف می‌سازد تا همه اعضای تیم در مسیر درست قرار گیرند. این مرحله پایه و اساس تمام تصمیمات بعدی خواهد بود.",
  },
  {
    step: 4,
    title: "طراحی خلاقانه",
    description:
      "در این مرحله نیازها و خواسته‌های شما را بطور دقیق مشخص می‌کنیم. هدف، تصویر کلّی پروژه را شفاف می‌سازد تا همه اعضای تیم در مسیر درست قرار گیرند. این مرحله پایه و اساس تمام تصمیمات بعدی خواهد بود.",
  },
  {
    step: 5,
    title: "توسعه‌ی قدرتمند",
    description:
      "در این مرحله نیازها و خواسته‌های شما را بطور دقیق مشخص می‌کنیم. هدف، تصویر کلّی پروژه را شفاف می‌سازد تا همه اعضای تیم در مسیر درست قرار گیرند. این مرحله پایه و اساس تمام تصمیمات بعدی خواهد بود.",
  },
  {
    step: 6,
    title: "راه‌اندازی و گسترش",
    description:
      "در این مرحله نیازها و خواسته‌های شما را بطور دقیق مشخص می‌کنیم. هدف، تصویر کلّی پروژه را شفاف می‌سازد تا همه اعضای تیم در مسیر درست قرار گیرند. این مرحله پایه و اساس تمام تصمیمات بعدی خواهد بود.",
  },
];

const FlowCards = () => {
  return (
    <section className="container mx-auto px-6 py-24" dir="rtl">
      <div className="grid gap-8 md:grid-cols-2 xl:grid-cols-3">
        {steps.map((item) => (
          <FlowCard key={item.step} {...item} />
        ))}
      </div>
    </section>
  );
};

export default FlowCards;
